# Да се напише програма, която чете n-на брой цели числа, въведени от потребителя и ги сумира.
# ⦁	От първия ред на входа се въвежда броят числа n.
# ⦁	От следващите n реда се въвежда по едно цяло число.
# Програмата трябва да прочете числата, да ги сумира и да отпечата сумата им.

# input:
# 2
# 10
# 20
# expected output:
# 30

# input:
# 3
# -10
# -20
# -30
# expected output:
# -60

count = int(input())
number = 0
sum = 0
for n in range(0, count):
    number = int(input())
    sum += number
print(sum)
