# Лили вече е на N години. За всеки свой рожден ден тя получава подарък.
# За нечетните рождени дни (1, 3, 5...n) получава играчки, а за всеки четен (2, 4, 6...n) получава пари.
# За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв.,
# за всеки следващ четен рожден ден (2 -> 10, 4 -> 20, 6 -> 30...и т.н.).
# През годините Лили тайно е спестявала парите. Братът на Лили, в годините, които тя получава пари,
# взима по 1.00 лев от тях. Лили продала играчките получени през годините,
# всяка за P лева и добавила сумата към спестените пари.
# С парите искала да си купи пералня за X лева.
# Напишете програма, която да пресмята, колко пари е събрала и дали ѝ стигат да си купи пералня.

# Вход
# Програмата прочита 3 числа, въведени от потребителя, на отделни редове:
# ⦁	Възрастта на Лили - цяло число в интервала [1...77]
# ⦁	Цената на пералнята - число в интервала [1.00...10 000.00]
# ⦁	Единична цена на играчка - цяло число в интервала [0...40]

# Изход
# Да се отпечата на конзолата един ред:
# ⦁	Ако парите на Лили са достатъчни:
# ⦁	"Yes! {N}" - където N е остатъка пари след покупката
# ⦁	Ако парите не са достатъчни:
# ⦁	"No! {М}" - където M е сумата, която не достига
# ⦁	Числата N и M трябва да за форматирани до вторият знак след десетичната запетая.


# input:
# 10
# 170.00
# 6
# expected output:
# Yes! 5.00

# input:
# 21
# 1570.98
# 3
# expected output:
# No! 997.98

Lily_age = int(input())
laundry_price = float(input())
toy_price = int(input())
toys = 0
sum = 0
mn = 1
for n in range(1, Lily_age + 1):
    if n % 2 == 0:
        sum += 10 * mn
        mn += 1
        sum -= 1
    else:
        toys += 1
sum += toys * toy_price
if sum >= laundry_price:
    print(f"Yes! {sum - laundry_price:.2f}")
else:
    print(f"No! {laundry_price - sum:.2f}")
