# Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа.
# На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число.
# Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е намерено.

# Вход
# Входът се чете от конзолата и се състои от три реда:
# ⦁	Първи ред – начало на интервала – цяло число в интервала [1...999]
# ⦁	Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
# ⦁	Трети ред – магическото число – цяло число в интервала [1...10000]

# Изход
# На конзолата трябва да се отпечата един ред, според резултата:
# ⦁	Ако е намерена комбинация чиито сбор на числата е равен на магическото число
# ⦁	"Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
# ⦁	Ако не е намерена комбинация отговаряща на условието
# ⦁	"{броят на всички комбинации} combinations - neither equals {магическото число}"

# input:
# 1
# 10
# 5
# expected output:
# Combination N:4 (1 + 4 = 5)

# input:
# 23
# 24
# 20
# expected output:
# 4 combinations - neither equals 20

start = int(input())
end = int(input())
magic_number = int(input())

found = False
counter = 0

for number in range(start, end + 1):
    for number1 in range(start, end + 1):
        counter += 1
        if number + number1 == magic_number:
            found = True
            print(f"Combination N:{counter} ({number} + {number1} = {magic_number})")
            break
    if found:
        break
if not found:
    print(f"{counter} combinations - neither equals {magic_number}")
