# Напишете програма, която изчислява каква сума ще получите в края на депозитния период
# при определен лихвен процент. Използвайте следната формула:
# сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)

# От конзолата се четат 3 реда:
# ⦁	Депозирана сума – реално число;
# ⦁	Срок на депозита(в месеци) – цяло число;
# ⦁	Годишен лихвен процент – реално число;


# input ->    200
#               3
#               5.7
# expected output ->  202.85

# input ->    2350
#                6
#                7
# expected output ->  2432.25

deposit = float(input())
months = int(input())
margin = float(input())/100
sum = deposit + months * ((deposit * margin) / 12)
print(sum)
