# За лятната ваканция в спикъка със задължителна литература на Жоро има определен брой книги,
# но Жоро предпочита да играе с приятели навън.
# Вашата задача е да помогнете на Жоро да изчисли колко часа на ден трябва да отделя,
# за да прочете необходимата литература, но и да прекарва максимално време навън.

# От конзолата се четат 3 реда:
# ⦁	Брой страници в текущата книга – цяло число;
# ⦁	Страници, които може да прочита за 1 час – цяло число;
# ⦁	Броя на дните, за които трябва да прочете книгата – цяло число;

# input ->    212
#              20
#               2
# expected output ->  5.3

# input ->    432
#              15
#               4
# expected output ->  7.2

pages = int(input())
pages_per_hour = int(input())
deadline = int(input())

plan = ((pages / pages_per_hour) / deadline)
print(plan)