# В сладкарница се провежда благотворителна кампания за събиране на средства,
# в която могат да се включат сладкари от цялата страна.
# Първоначално прочитаме от конзолата броя на дните, в които тече кампанията и броя на сладкарите,
# които ще се включат. След това на отделни редове получаваме количеството на тортите, гофретите и палачинките,
# които ще бъдат приготвени от един сладкар за един ден. Трябва да се има предвид следния ценоразпис:
# ⦁	Торта - 45 лв.
# ⦁	Гофрета - 5.80 лв.
# ⦁	Палачинка – 3.20 лв.
# 1/8 от крайната сума ще бъде използвана за покриване на разходите за продуктите по време на кампанията.
# Да се напише програма, която изчислява сумата, която е събрана в края на кампанията.

# От конзолата се четат 5 реда:
# ⦁	Броят на дните, в които тече кампанията – цяло число;
# ⦁	Броят на сладкарите – цяло число;
# ⦁	Броят на тортите – цяло число;
# ⦁	Броят на гофретите – цяло число;
# ⦁	Броят на палачинките – цяло число.

# input ->    23
#              8
#             14
#             30
#             16
# expected output ->   137687.2

# input ->    131
#               5
#               9
#              33
#              46
# expected output ->  426175.75


days = int(input())
confectioners = int(input())
cakes = int(input())
waffles = int(input())
pancakes = int(input())

sum = days * confectioners * (cakes * 45 + waffles * 5.8 + pancakes * 3.2)
profit = sum - sum / 8
print(profit)
