# За рождения си ден Любомир получил аквариум с формата на паралелепипед.
# Трябва да се пресметне колко литра вода ще събира аквариума, ако се знае,
# че определен процент от вместимостта му е заета от пясък, растения, нагревател и помпа.
# Размерите му – дължина, широчина и височина в сантиметри ще бъдат въведени от конзолата.
# Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/.
# Да се напише програма, която изчислява литрите вода, които са необходими за напълването на аквариума.

# От конзолата се четат 4 реда:
# ⦁	Дължина в см – цяло число
# ⦁	Широчина в см – цяло число
# ⦁	Височина в см – цяло число
# ⦁	Процент зает обем – реално число


# input ->    85
#             75
#             47
#             17
# expected output ->  248.68875

# input ->    105
#              77
#              89
#              18.5
# expected output ->  586.445475

length = int(input())
width = int(input())
height = int(input())
filled_percentage = float(input()) / 100

meters_cubic = length * width * height
compatible_litres = meters_cubic * 0.001
needes_litres = compatible_litres * (1 - filled_percentage)
print(needes_litres)
