# Напишете програма, която чете цяло число от конзолата и на всеки следващ ред цели числа,
# докато тяхната сума стане по-голяма или равна на първоначалното число.
# След приключване на четенето да се отпечата сумата на въведените числа.

# input:
# 100
# 10
# 20
# 30
# 40
# expected output:
# 100

# input:
# 20
# 1
# 2
# 3
# 4
# 5
# 6
# expected output:
# 21

number = int(input())
sum = 0
while sum < number:
    number_sum = int(input())
    sum += number_sum

print(sum)
