# За рожденният ден на дъщеря си Людмила е решила да организира парти,
# на което да покани всичките ѝ съученици.
# За целта е решила да наеме развлекателна зала за деца, чийто наем ще получите като вход от конзолата.
# Напишете програма, с която да помогнете на Людмила да изчисли какъв бюджет ще ѝ бъде необходим,
# като имате следната информация за допълнителните неща, необходими за тържеството:

# ⦁	Торта  – цената ѝ е 20% от наема на залата
# ⦁	Напитки – цената им е 45% по-малко от тази на тортата
# ⦁	Аниматор – цената му е 1/3 от цената за наема на залата


# input ->    2250
# expected output ->  3697.5

# input ->    3720
# expected output ->  6113.2

rent = int(input())

animator = rent / 3
cake = 0.2 * rent
drinks = cake - cake * 0.45
sum = animator + cake + drinks + rent
print(sum)