# Дадени са n-на брой цели числа в интервала [1…1000]. От тях някакъв процент p1 се делят без остатък на 2,
# друг процент p2 се делят без остатък на 3, друг процент p3 се делят без остатък на 4.
# Да се напише програма, която изчислява и отпечатва процентите p1, p2 и p3.

# Пример: имаме n = 10 числа: 680, 2, 600, 200, 800, 799, 199, 46, 128, 65. Получаваме следното разпределение и визуализация:
# Деление без остатък на:	Числа в диапазона	                Брой числа	    Процент
# 2	                        680, 2, 600, 200, 800, 46, 128	    7	            p1 = 7 / 10 * 100 = 70.00%
# 3	                        600	                                1	            p2 = 1 / 10 * 100 = 10.00%
# 4	                        680, 600, 200, 800, 128	            5	            p3 = 5 / 10 * 100 = 50.00%

# Вход
# На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) - брой числа.
# На следващите n реда стои по едно цяло число в интервала [1…1000] -
# числата които да бъдат проверени на колко се делят.

# Изход
# Да се отпечатат на конзолата 3 реда, всеки от които съдържа процент между 0% и 100%,
# с точност две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.

# ⦁	На първият ред - процентът на числата които се делят на 2
# ⦁	На вторият ред - процентът на числата които се делят на 3
# ⦁	На третият ред - процентът на числата които се делят на 4

# input:
# 10
# 680
# 2
# 600
# 200
# 800
# 799
# 199
# 46
# 128
# 65
# expected output:
# 70.00%
# 10.00%
# 50.00%

# input:
# 3
# 3
# 6
# 9
# expected output:
# 33.33%
# 100.00%
# 0.00%

# Дадени са n-на брой цели числа в интервала [1…1000].
# От тях някакъв процент p1 се делят без остатък на 2, друг процент p2 се делят без остатък на 3,
# друг процент p3 се делят без остатък на 4. Да се напише програма, която изчислява и отпечатва процентите p1, p2 и p3.
# Пример: имаме n = 10 числа: 680, 2, 600, 200, 800, 799, 199, 46, 128, 65. Получаваме следното разпределение и визуализация:

# Изход
# Да се отпечатат на конзолата 3 реда, всеки от които съдържа процент между 0% и 100%,
# с точност две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.
# ⦁	На първият ред - процентът на числата които се делят на 2
# ⦁	На вторият ред - процентът на числата които се делят на 3
# ⦁	На третият ред - процентът на числата които се делят на 4
count = int(input())
na_2 = 0
na_3 = 0
na_4 = 0
for n in range(0, count):
    number = int(input())
    if number % 2 == 0:
        na_2 += 1
    if number % 3 == 0:
        na_3 += 1
    if number % 4 == 0:
        na_4 += 1
p1 = na_2 / count * 100
p2 = na_3 / count * 100
p3 = na_4 / count * 100

print(f"{p1:.2f}%")
print(f"{p2:.2f}%")
print(f"{p3:.2f}%")
