# Напишете програма, която чете от конзолата две шестцифрени цели числа в диапазона.
# Винаги първото въведено число ще бъде по-малко от второто.
# На конзолата да се отпечатат на 1, ред разделени с интервал, всички числа, които се намират между двете,
# прочетени от конзолата числа, и отговарят на условието сумата от цифрите на четни и нечетни позиции да са равни.
# Ако няма числа, отговарящи на условието на конзолата не се извежда резултат.

# input:
# 100000
# 100050
# expected output:
# 100001 100012 100023 100034 100045

# input:
# 123456
# 124000
# expected output:
# 123464 123475 123486 123497 123530 123541 123552 123563 123574 123585 123596 123640 123651 123662 123673 123684 123695 123750 123761 123772 123783 123794 123860 123871 123882 123893 123970 123981 123992

number1 = int(input())
number2 = int(input())
even_sum = 0
odd_sum = 0
for n in range(number1, number2 + 1):
    number_to_str = str(n)
    even_sum = 0
    odd_sum = 0
    for index, digit in enumerate(number_to_str):
        if index % 2 == 0:
            even_sum += int(digit)
        else:
            odd_sum += int(digit)
    if even_sum == odd_sum:
        print(n, end=" ")
