# Да се напише програма, която чете две цели числа n и l, въведени от потребителя,
# и генерира по азбучен ред всички възможни  пароли, които се състоят от следните 5 символа:

# ⦁	Символ 1: цифра от 1 до n;
# ⦁	Символ 2: цифра от 1 до n;
# ⦁	Символ 3: малка буква измежду първите l букви на латинската азбука;
# ⦁	Символ 4: малка буква измежду първите l букви на латинската азбука;
# ⦁	Символ 5: цифра от 1 до n, по-голяма от първите 2 цифри.

# Вход
# Входът се чете от конзолата и се състои от две цели числа n и l, по едно на ред.

# Изход
# На конзолата трябва да се отпечатат всички пароли по азбучен ред, разделени с интервал.

# input:
# 2
# 4
# expected output:
# 11aa2 11ab2 11ac2 11ad2 11ba2 11bb2 11bc2 11bd2 11ca2 11cb2 11cc2 11cd2 11da2 11db2 11dc2 11dd2

# input:
# 3
# 1
# expected output:
# 11aa2 11aa3 12aa3 21aa3 22aa3

n = int(input())
l = int(input())

for num1 in range(1, n):
    for num2 in range(1, n):
        for letter1 in range(97, 97 + l):
            for letter2 in range(97, 97 + l):
                if num1 >= num2:
                    num3 = num1 + 1
                else:
                    num3 = num2 + 1
                for num3 in range(num3, n + 1):
                    print(f"{num1}{num2}{chr(letter1)}{chr(letter2)}{num3}", end=" ")
